{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "CWE-119",
    "1": "CWE-787",
    "2": "CWE-125",
    "3": "CWE-416",
    "4": "CWE-476",
    "5": "CWE-362",
    "6": "CWE-94",
    "7": "CWE-78",
    "8": "CWE-190",
    "9": "CWE-264",
    "10": "CWE-200",
    "11": "CWE-287",
    "12": "CWE-798",
    "13": "CWE-400",
    "14": "CWE-843"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "CWE-119": 0,
    "CWE-125": 2,
    "CWE-190": 8,
    "CWE-200": 10,
    "CWE-264": 9,
    "CWE-287": 11,
    "CWE-362": 5,
    "CWE-400": 13,
    "CWE-416": 3,
    "CWE-476": 4,
    "CWE-78": 7,
    "CWE-787": 1,
    "CWE-798": 12,
    "CWE-843": 14,
    "CWE-94": 6
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 514,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 52000
}
