{
  "add_cross_attention": false,
  "architectures": [
    "BertForSequenceClassification"
  ],
  "attention_probs_dropout_prob": 0.1,
  "bos_token_id": null,
  "classifier_dropout": null,
  "dtype": "float32",
  "eos_token_id": null,
  "gradient_checkpointing": false,
  "hidden_act": "gelu",
  "hidden_dropout_prob": 0.1,
  "hidden_size": 768,
  "id2label": {
    "0": "CWE-79",
    "1": "CWE-200",
    "2": "CWE-20",
    "3": "CWE-119",
    "4": "CWE-264",
    "5": "CWE-22",
    "6": "CWE-89",
    "7": "CWE-502",
    "8": "CWE-287",
    "9": "CWE-787",
    "10": "CWE-798",
    "11": "CWE-94",
    "12": "CWE-399",
    "13": "CWE-78",
    "14": "CWE-306",
    "15": "CWE-416",
    "16": "CWE-125",
    "17": "CWE-918",
    "18": "CWE-352",
    "19": "CWE-362"
  },
  "initializer_range": 0.02,
  "intermediate_size": 3072,
  "is_decoder": false,
  "label2id": {
    "CWE-119": 3,
    "CWE-125": 16,
    "CWE-20": 2,
    "CWE-200": 1,
    "CWE-22": 5,
    "CWE-264": 4,
    "CWE-287": 8,
    "CWE-306": 14,
    "CWE-352": 18,
    "CWE-362": 19,
    "CWE-399": 12,
    "CWE-416": 15,
    "CWE-502": 7,
    "CWE-78": 13,
    "CWE-787": 9,
    "CWE-79": 0,
    "CWE-798": 10,
    "CWE-89": 6,
    "CWE-918": 17,
    "CWE-94": 11
  },
  "layer_norm_eps": 1e-12,
  "max_position_embeddings": 514,
  "model_type": "bert",
  "num_attention_heads": 12,
  "num_hidden_layers": 6,
  "pad_token_id": 0,
  "tie_word_embeddings": true,
  "transformers_version": "5.3.0",
  "type_vocab_size": 1,
  "use_cache": false,
  "vocab_size": 52000
}
